/*************************************************************************
	> File Name: 113-一个月有几天.c
	> Author: chenyueze
	> Mail: chen_buzhou@163.com
	> Created Time: 二  9/ 1 16:16:55 2020
 ************************************************************************/

#include<stdio.h>

int main(){
    int num[13] = {0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};
    int y, m;
    scanf("%d%d", &y, &m);
    if(m != 2 || !( (y % 4 == 0 && y % 100 != 0) || y % 400 == 0 ) ) {
        printf("%d\n", num[m]);
    }else{
        printf("%d\n", num[m] + 1);
    }
    return 0;
}
